### this file is generated by `brew bundle dump`
### `brew tap`
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

### `brew install`
# fzf
brew "fzf"
brew "fd"
brew "ripgrep" # rg
brew "bat"
brew "tree"

# git
brew "git"
brew "git-flow"  # "git-flow-avh", 二选一即可
brew "git-delta" # git diff 工具
brew "lazygit"   # git cui 工具, 还有 "gitui"

# terminal
brew "ranger" # terminal file explorer 文件管理器
brew "viu"    # terminal 图片显示工具
#brew "w3m"   # terminal 访问网页工具

# editor
brew "neovim"
brew "vim"
brew "tmux"
brew "pandoc"  # 文档格式转换工具, 支持 word, pdf, markdown ... 各种格式
brew "universal-ctags"  # 各种语言的 object 分析工具. vim/neovim tagbar 插件使用

# language & tools
brew "node"
#brew "go"  # 推荐使用 https://go.dev 中下载安装.
#brew "rust"
#brew "lua"     # "luajit", "luarocks", "stylua" ...
brew "prettier" # 格式化工具
#brew "shfmt"   # shell 格式化工具
brew "clang-format" # c,c++,object-c 格式化工具

# dev tools
brew "graphviz" # 图表绘制工具, go 性能分析需要用到
brew "protobuf" # `protoc` 命令行工具
#brew "curl"    # http(s) 请求工具, 自带.
brew "wget"     # http(s) 下载工具
brew "grpcurl"  # gprc 请求工具, 类似 "curl".
brew "rclone"   # ftp / sftp / webstorage ... 工具
brew "siege"    # http request 压力测试工具

# others
brew "ffmpeg"
brew "yt-dlp"  # fork youtube-dl

# deps 不同版本
brew "openssl@1.1"  # openssl@1.1 was designated an LTS release. 有些 app 依赖 openssl@3
brew "ca-certificates"

### `brew install --cask`
# 开发工具
cask "alacritty"
cask "iterm2"
cask "visual-studio-code" # vscode
cask "postman"   # http(s) 测试工具
cask "wireshark" # http 请求分析工具
cask "beekeeper-studio"  # Postgre, Mysql, MariaDB, SQLite, CockroachDB, AWS Redshift, MS SQL server
cask "tableplus"         # Postgre, Mysql, MariaDB, SQLite, CockroachDB, AWS Redshift, MS SQL server, redis, MongoDB, Oracle, Cassandra, Snowflake, Vertica
#cask "pgadmin4"   # Postgre GUI client
#cask "another-redis-desktop-manager"  # redis GUI client
#cask "sourcetree" # git 工具, 好用但不开源

# 个人工具
cask "squirrel"   # RIME 输入法客户端
cask "appcleaner" # app 卸载工具
cask "keepassxc"  # keepass 客户端, 密码管理工具, eg: "macpass", "authpass" ...
cask "openvpn-connect"
cask "keka"  # 压缩工具
cask "the-unarchiver"  # 解压工具
cask "typora"  # markdown 编辑软件
cask "joplin"  # 加密的 markdown 笔记管理工具
cask "keycastr"  # 按键输入显示工具

cask "signal"   # 加密聊天工具
cask "telegram" # 加密聊天工具
cask "iina"     # 视频播放器
cask "calibre"  # 电子书工具, epub, mobi ...

# 浏览器
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"
cask "tor-browser"
