### this file is generated by `brew bundle dump`

### `brew tap` -------------------------------------------------------------------------------------
tap "homebrew/bundle"
# 以下库新版 homebrew 不需要装, `brew dr` 时会提示 untap.
#tap "homebrew/cask"
#tap "homebrew/core"
#tap "homebrew/services"

### `brew install` ---------------------------------------------------------------------------------
# fzf
brew "fzf"
brew "fd"      # rust find
brew "bat"     # rust cat
brew "ripgrep" # rust grep, `rg`
brew "tree"

# git
brew "git"
brew "git-flow"  # "git-flow-avh", 二选一即可
brew "git-delta" # git diff 工具
brew "lazygit"   # git cui 工具, 还有 "gitui"

# terminal
brew "ranger" # terminal file explorer 文件管理器
brew "viu"    # terminal 图片显示工具
#brew "w3m"   # terminal 访问网页工具

# editor
brew "neovim"
brew "vim"
brew "tmux"
brew "pandoc"  # 文档格式转换工具, 支持 word, pdf, markdown ... 各种格式
brew "universal-ctags"  # 各种语言的 object 分析工具. vim/neovim tagbar 插件使用

# language & tools
brew "node"
brew "node@18"  # LTS version for Github Copilot 和某些其他应用
#brew "go"      # 推荐使用 https://go.dev 中下载安装.
#brew "rust"
#brew "lua"
#brew "luajit"

# format tools
brew "prettier" # 格式化工具
#brew "shfmt"   # shell 格式化工具
#brew "clang-format" # c,c++,object-c 格式化工具

# dev tools
brew "graphviz" # 图表绘制工具, go 性能分析需要用到
brew "protobuf" # `protoc` 命令行工具
brew "grpcurl"  # gprc 请求工具, 类似 "curl".
brew "rclone"   # ftp / sftp / webstorage ... 工具
brew "siege"    # http request 压力测试工具
brew "wget"     # http(s) 下载工具
#brew "curl"    # http(s) 请求工具, mac 自带.

# Dependencies
#brew "ca-certificates"

# 其他工具
brew "ffmpeg"
brew "yt-dlp"  # fork youtube-dl
brew "wimlib"  # 解决 FAT32 不能保存大于 4GB ios 文件的问题. 解决 FAT32 启动盘的制作问题.

### `brew install --cask` --------------------------------------------------------------------------
# 开发工具
cask "alacritty"
cask "iterm2"
cask "raycast"  # alfred 替代
cask "visual-studio-code" # vscode
cask "postman"   # http(s) 测试工具
#cask "wireshark" # http 请求分析工具
#cask "sourcetree"     # git 工具, 好用但不开源, 目前使用 lazygit 代替
#cask "vmware-fusion"  # Hypervisor 工具

# 数据库工具
cask "beekeeper-studio"  # Postgre, Mysql, MariaDB, SQLite, CockroachDB, AWS Redshift, MS SQL server, 开源免费软件.
cask "tableplus"         # Postgre, Mysql, MariaDB, SQLite, CockroachDB, AWS Redshift, MS SQL server, redis, MongoDB, Oracle, Cassandra, Snowflake, Vertica
#cask "another-redis-desktop-manager"  # redis GUI client
#cask "pgadmin4"   # Postgre GUI client

# 笔记工具
cask "obsidian" # markdown 编辑软件
cask "typora"   # markdown 编辑软件
cask "joplin"   # 加密的 markdown 笔记管理工具

# 个人工具
cask "squirrel"   # RIME 输入法客户端
cask "appcleaner" # app 卸载工具
cask "app-cleaner"  # mac 系统清理工具, 类似 CleanMyMac
cask "keepassxc"  # keepass 客户端, 密码管理工具, eg: "macpass", "authpass" ...
cask "keka"  # 压缩工具
cask "the-unarchiver"  # 解压工具
cask "keycastr"  # 按键输入显示工具
cask "lulu"  # 防火墙
#cask "rectangle" # window resize app, 可以用 raycast 代替
#cask "openvpn-connect"

# 其他个人 app
cask "iina"     # 视频播放器
cask "calibre"  # 电子书工具, epub, mobi ...
cask "telegram" # 加密聊天工具
#cask "signal"  # 加密聊天工具

# 浏览器
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"
#cask "tor-browser"
