Nerd_icons = {
  diag = {
    hint  = "󱩎",  -- ⚐ ⚑ 󰛨
    info  = "",  -- 𝖎    
    warn  = "",  -- ⚠️  
    error = "",  -- ❌✕✖︎✗✘⛌
  },
  arrows = {
    right = '→',
    left = '←',
    up = '↑',
    down = '↓',

    tri_right = '',
    tri_left = '',
    tri_up = '',
    tri_down = '',
  },
  indent = {
    edge   = "│",
    item   = "├",
    corner = "└",
  },
  border = {"▄","▄","▄","█","▀","▀","▀","█"},
  tick = '✔︎',  -- ✓✔︎  
  cross = '⛌', -- ❌✕✖︎✗✘⛌ 
  star = '★',
  dot = '●',
  h_dot = "○",
  ellipsis = '…',
  h_circle = "◌", --  
}
